In [1]:
import pandas as pd

In [2]:
# student_df = pd.read_csv("student_marks.csv")

In [3]:
# df_students.rename(columns = {"quiz_1":"mini_exam_1","quiz_2":"mini_exam_2","quiz_3":"mini_exam_3"},inplace = True)

In [4]:
# new_df = df_students.iloc[:10]

In [5]:
# To concatenate the two data frames
# pd.concate([df_students,new_df],axis=0,ignore_index = True)

In [6]:
orders = pd.read_csv("orders.csv",parse_dates = ["order_date"])
products = pd.read_csv("products.csv")
products

   product_id product_name     category   price
0        P001        Stage     Clothing  534.93
1        P002        Least  Accessories   56.56
2        P003       Number         Home  339.92
3        P004      Evening     Clothing  138.74
4        P005      Protect     Footwear   68.06
..        ...          ...          ...     ...
95       P096      Service     Footwear  872.76
96       P097         Away         Home  932.46
97       P098     Decision  Accessories  567.31
98       P099           So  Electronics  698.17
99       P100   Everything         Home  922.89

[100 rows x 4 columns]

In [7]:
orders.dtypes

order_id               object
customer_id            object
product_id             object
quantity                int64
order_date     datetime64[ns]
dtype: object

In [8]:
orders_merge = orders.merge(products[["product_id","product_name","price"]], on="product_id", how = "left")

In [9]:
orders_merge["total_price"]= orders_merge["quantity"]*orders_merge["price"]

In [10]:
orders_merge

,order_id,customer_id,product_id,quantity,order_date,product_name,price,total_price
0,O00001,C0333,P022,1,2022-01-09,Tax,185.33,185.33
1,O00002,C0068,P090,1,2022-01-27,Perform,947.55,947.55
2,O00003,C0483,P021,1,2022-01-17,Art,938.65,938.65
3,O00004,C0214,P076,4,2022-01-07,Amount,154.17,616.68
4,O00005,C0411,P073,4,2022-01-12,Second,131.85,527.40
...,...,...,...,...,...,...,...,...
2579,O02580,C0237,P098,5,2024-12-22,Decision,567.31,2836.55
2580,O02581,C0236,P007,1,2024-12-05,Finish,325.74,325.74
2581,O02582,C0029,P035,1,2024-12-12,First,362.04,362.04
2582,O02583,C0171,P077,1,2024-12-16,Government,233.11,233.11
2583,O02584,C0421,P038,5,2024-12-01,Black,817.52,4087.60

In [11]:
total_sales_in_2022 = orders_merge[orders_merge.order_date.dt.year == 2022].total_price.sum()

In [13]:
total_sales_in_2022

1357500.38

In [16]:
data  = [[2.5,4.7,-6.9],[8.-5,9.7,2.0]]
mydf = pd.DataFrame(data)

In [17]:
mydf

     0    1    2
0  2.5  4.7 -6.9
1  3.0  9.7  2.0

In [18]:
mydf.abs()

     0    1    2
0  2.5  4.7  6.9
1  3.0  9.7  2.0

In [19]:
mydf.all()

0    True
1    True
2    True
dtype: bool

In [21]:
# mydf.append()  #to add the cell/column to our dataset

In [23]:
mydf[3] = [1,2]

In [24]:
mydf

     0    1    2  3
0  2.5  4.7 -6.9  1
1  3.0  9.7  2.0  2

In [26]:
orders.columns

Index(['order_id', 'customer_id', 'product_id', 'quantity', 'order_date'], dtype='object')

In [33]:
df1 = pd.DataFrame([[1,2,3],[6,7,8]])     #Help us to combine multiple datasets based on certain condition
df2 = pd.DataFrame([[5,6,7],[8,2,1]])

def my_function(a,b):
    return a if (a.sum() > b.sum()) else b
        
df1.combine(df2,my_function)

   0  1  2
0  5  2  3
1  8  7  8

In [37]:
print(df1)
print(df2)
print(df1.compare(df2))

   0  1  2
0  1  2  3
1  6  7  8
   0  1  2
0  5  6  7
1  8  2  1
     0          1          2
  self other self other self other
0    1     5    2     6    3     7
1    6     8    7     2    8     1

In [40]:
print(df1)
df1.diff()  # rowElement(n+1)-rowElement(n) Note: For row 0 it shows Nan values.

   0  1  2
0  1  2  3
1  6  7  8

     0    1    2
0  NaN  NaN  NaN
1  5.0  5.0  5.0

In [46]:
df1.diff(30)

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN

In [48]:
df1.duplicated().sum()   #Tell us the no.of rows that are duplicate/same in our dataset (Used to avoid biasness)

0

In [49]:
# df_students.fill() #used to fill the 'null' values with the specified value. 
# df_students.fillna() #used to fill the 'Nan' values with the specified value.

In [61]:
# group_by(column_name)  
# print(df_students.groupby(["Pass"]))

In [63]:
# transform()  #works same as groupby function
# df1.transform?